waveshareteam/ESP32-P4-WIFI6-Touch-LCD-X/examples/esp-idf/04_wifistation/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
